In [1]:
import pandas as pd

## Capítulo 5

### Trabalhando com datas

In [2]:
dados = pd.read_csv('vendas_produtos.csv')

dados

           Data;Produto;Volume (kg)
0             2022-03-22;Tomate;890
1     2022-03-04;Batata Inglesa;680
2             2022-05-23;Cebola;796
3             2022-07-27;Tomate;519
4             2022-04-05;Cebola;100
...                             ...
7495          2022-07-06;Cebola;319
7496          2022-12-27;Cebola;377
7497  2022-04-18;Batata Inglesa;175
7498          2022-02-01;Cebola;851
7499          2022-11-04;Cebola;402

[7500 rows x 1 columns]

In [3]:
dados = pd.read_csv('vendas_produtos.csv', sep=';')

dados

            Data         Produto  Volume (kg)
0     2022-03-22          Tomate          890
1     2022-03-04  Batata Inglesa          680
2     2022-05-23          Cebola          796
3     2022-07-27          Tomate          519
4     2022-04-05          Cebola          100
...          ...             ...          ...
7495  2022-07-06          Cebola          319
7496  2022-12-27          Cebola          377
7497  2022-04-18  Batata Inglesa          175
7498  2022-02-01          Cebola          851
7499  2022-11-04          Cebola          402

[7500 rows x 3 columns]

In [4]:
dados.dtypes

Data           object
Produto        object
Volume (kg)     int64
dtype: object

In [5]:
# Convertendo a coluna Produto para o tipo categórico
dados["Produto"] = dados["Produto"].astype("category")

# Convertendo a coluna de Volume (kg) par ao tipo ponto flutuante, ou com casas decimais
dados["Volume (kg)"] = dados["Volume (kg)"].astype(float)

In [6]:
dados.dtypes

Data             object
Produto        category
Volume (kg)     float64
dtype: object

In [8]:
dados["Data"] = pd.to_datetime(dados["Data"])

In [9]:
dados.dtypes

Data           datetime64[ns]
Produto              category
Volume (kg)           float64
dtype: object

In [10]:
dados['Ano'] = dados['Data'].dt.year

In [12]:
dados['Mês'] = dados['Data'].dt.month

In [13]:
dados['Trimestre'] = dados['Data'].dt.quarter

In [14]:
dados

           Data         Produto  Volume (kg)   Ano  Mês  Trimestre
0    2022-03-22          Tomate        890.0  2022    3          1
1    2022-03-04  Batata Inglesa        680.0  2022    3          1
2    2022-05-23          Cebola        796.0  2022    5          2
3    2022-07-27          Tomate        519.0  2022    7          3
4    2022-04-05          Cebola        100.0  2022    4          2
...         ...             ...          ...   ...  ...        ...
7495 2022-07-06          Cebola        319.0  2022    7          3
7496 2022-12-27          Cebola        377.0  2022   12          4
7497 2022-04-18  Batata Inglesa        175.0  2022    4          2
7498 2022-02-01          Cebola        851.0  2022    2          1
7499 2022-11-04          Cebola        402.0  2022   11          4

[7500 rows x 6 columns]

In [22]:
dados = dados.groupby(['Trimestre','Produto'], observed=True)['Volume (kg)'].sum().reset_index()
dados.sort_values(by=['Trimestre','Produto'])

    Trimestre         Produto  Volume (kg)
0           1  Batata Inglesa     343710.0
1           1          Cebola     329142.0
2           1          Tomate     346782.0
3           2  Batata Inglesa     343413.0
4           2          Cebola     353477.0
5           2          Tomate     347720.0
6           3  Batata Inglesa     348297.0
7           3          Cebola     371984.0
8           3          Tomate     349099.0
9           4  Batata Inglesa     333944.0
10          4          Cebola     343629.0
11          4          Tomate     327070.0